package by.it.pkochubei.jd01_01;
/*
напишите программу которая выводит на экран
Hello world!

(строка должа быть одна, ошибки в тексте не допускаются)
Для ручной проверки запустите программу Ctrl+Shift+F10
Для автоматической проверки откройте и запустите класс Testing
*/

import com.sun.org.apache.xerces.internal.impl.xs.models.XSCMUniOp;

class TaskA1 {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}
