package by.it.zhuravaskarabahataya.jd01_12;


//TaskC1. Нужно ввести с консоли текст до строки end.
// Во входном тексте  хранятся наименования некоторых объектов, по одному в строке.
// Строки иногда повторяются.
//  Построить список C1, элементы которого содержат наименования и уникальные шифры данных объектов,
// причем элементы списка должны быть упорядочены по возрастанию шифров
// (шифр – некоторое случайное, но гарантированно уникальное число).
//  Затем нужно «сжать» список C1, удаляя дублирующийся наименования объектов.
//  Выведите полученный ассоциативный массив в консоль
class TaskC1 {
    public static void main(String[] args) {

    }
}
